public/blog/impcore-pl-ocaml.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgcb60fb0" class="outline-2">
<h2 id="orgcb60fb0">The Impcore language in OCaml</h2>
<div class="outline-text-2" id="text-orgcb60fb0">
<p>
Here.
</p>

<p>
Some OCaml,
</p>

<div class="org-src-container">
<pre class="src src-ocaml">let x = 42 in x
</pre>
</div>
</div>
<div id="outline-container-org7bac05f" class="outline-3">
<h3 id="org7bac05f">Metavariables</h3>
<div class="outline-text-3" id="text-org7bac05f">
<p>
x, <code>x</code> \(x_1\), \(x_1\).
</p>

\begin{array}{cc}
  a & b \\
  c & c
\end{array}

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">\(e\)</td>
<td class="org-left">Any expression</td>
</tr>

<tr>
<td class="org-left">\(d\)</td>
<td class="org-left">Any definition</td>
</tr>

<tr>
<td class="org-left">\(n\)</td>
<td class="org-left">Any numeral</td>
</tr>

<tr>
<td class="org-left">\(x\)</td>
<td class="org-left">Any name that is meant to refer to variable or parameter</td>
</tr>

<tr>
<td class="org-left">\(f\)</td>
<td class="org-left">Any name that is meant to refer to a function</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc444744" class="outline-3">
<h3 id="orgc444744">Environments</h3>
<div class="outline-text-3" id="text-orgc444744">
<ul class="org-ul">
<li>Environment \(\xi\) holds values for global variables.</li>
<li>Environment \(\phi\) holds definitions of functions.</li>
<li>Environment \(\rho\) holds values of a function's parameters.</li>
</ul>

<p>
Environments \(\xi\) and \(\phi\) are global and shared, but there is a distinct \(\rho\) for every function call. Together, their contents comprise Impcore's <i>basis</i>.
</p>
</div>
<div id="outline-container-orgd64a613" class="outline-4">
<h4 id="orgd64a613">Operating on environments</h4>
<div class="outline-text-4" id="text-orgd64a613">
<p>
Using function notation:
</p>

<ul class="org-ul">
<li>An empty environment, which does not bind any names, is written \(\{\}\).</li>
<li>Whatever is associated with name \(x\) in the environment \(\rho\) is written \(\rho(x)\).</li>
<li>The set of names bound in environment \(\rho\) is written \(\text{dom } \rho\).</li>
<li>An <b>extended environment</b> \(\rho\), plus a binding of the name \(x\) to \(v\), is written \(\rho \{ x \mapsto v\}\).</li>
<li>In an extended environment, the new binding hides previous bindings of \(x\):</li>
</ul>

\begin{array}
$\rho\{ x \mapsto v \}(y) =
  \begin{cases}
  v, & \text{when $x = y$} \\
  \rho(y), & \text{when $x \neq y$}
  \end{cases}
\end{array}
</div>
</div>
</div>
<div id="outline-container-org90807b1" class="outline-3">
<h3 id="org90807b1">Operational Semantics</h3>
<div class="outline-text-3" id="text-org90807b1">
<p>
An <i>abstract machine</i> and rules for its execution.
</p>

<p>
Metavariables of Impcore's operational semantics:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">\(e, e_i\)</td>
<td class="org-left">An expression</td>
</tr>

<tr>
<td class="org-left">\(d\)</td>
<td class="org-left">A definition</td>
</tr>

<tr>
<td class="org-left">\(x, x_i\)</td>
<td class="org-left">A name that refers to a variable or a parameter</td>
</tr>

<tr>
<td class="org-left">\(f\)</td>
<td class="org-left">A name that refers to a function</td>
</tr>

<tr>
<td class="org-left">\(v, v_i\)</td>
<td class="org-left">A value</td>
</tr>

<tr>
<td class="org-left">\(\xi, \xi', \ldots\)</td>
<td class="org-left">A global-variable environment</td>
</tr>

<tr>
<td class="org-left">\(\phi, \phi', \ldots\)</td>
<td class="org-left">A function-definition environment</td>
</tr>

<tr>
<td class="org-left">\(\rho, \rho', \ldots\)</td>
<td class="org-left">A formal-parameter environment</td>
</tr>
</tbody>
</table>

<p>
The states and transitions are described using the metavariables above.
</p>

<ul class="org-ul">
<li>Evaluating a definition \(d\): \(\langle d, \xi, \phi \rangle\) (definitions do not appear inside functions).</li>
<li>Evaluating an expression \(e\): \(\langle e, \xi, \phi, \rho \rangle\).</li>
<li>Between evaluations: \(\langle \xi, \phi \rangle\).</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
